wxzed/CH552_NOUDISK/S_CDC/CDC.C
}
/*******************************************************************************
* Function Name  : USBDeviceIntCfg()
* Description    : USB设备模式中断初始化
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USBDeviceIntCfg()
{
    USB_INT_EN |= bUIE_SUSPEND;                                               //使能设备挂起中断
    USB_INT_EN |= bUIE_TRANSFER;                                              //使能USB传输完成中断
    USB_INT_EN |= bUIE_BUS_RST;                                               //使能设备模式USB总线复位中断
    USB_INT_FG |= 0x1F;                                                       //清中断标志
    IE_USB = 1;                                                               //使能USB中断
    EA = 1;                                                                   //允许单片机中断
}
/*******************************************************************************
* Function Name  : USBDeviceEndPointCfg()
* Description    : USB设备模式端点配置，模拟兼容HID设备，除了端点0的控制传输，还包括端点2批量上下传
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USBDeviceEndPointCfg()
{
    UEP1_DMA = Ep1Buffer;                                                      //端点1 发送数据传输地址
    UEP2_DMA = Ep2Buffer;                                                      //端点2 IN数据传输地址	
    UEP2_3_MOD = 0xCC;                                                         //端点2/3 单缓冲收发使能
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;                 //端点2自动翻转同步标志位，IN事务返回NAK，OUT返回ACK
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
    //UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                                 //端点1自动翻转同步标志位，IN事务返回NAK	
    UEP0_DMA = Ep0Buffer;                                                      //端点0数据传输地址
    UEP4_1_MOD = 0X40;                                                         //端点1上传缓冲区；端点0单64字节收发缓冲区
    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;                                 //手动翻转，OUT事务返回ACK，IN事务返回NAK
}
/*******************************************************************************
* Function Name  : Config_Uart1(UINT8 *cfg_uart)
* Description    : 配置串口1参数
* Input          : 串口配置参数 四位波特率、停止位、校验、数据位
* Output         : None
* Return         : None
*******************************************************************************/
void Config_Uart1(UINT8 *cfg_uart)
{
	UINT32 x;
	UINT8 x2;
	UINT32 uart1_buad = 0;
	*((UINT8 *)&uart1_buad) = cfg_uart[3];
	*((UINT8 *)&uart1_buad+1) = cfg_uart[2];
	*((UINT8 *)&uart1_buad+2) = cfg_uart[1];
	*((UINT8 *)&uart1_buad+3) = cfg_uart[0];
	IE_UART1 = 0;
	x = 10 * FREQ_SYS / uart1_buad / 16;                                       //如果更改主频，注意x的值不要溢出                            
	x2 = x % 10;
	x /= 10;
	if ( x2 >= 5 ) x ++;                                                       //四舍五入
	SBAUD1 =  0 - x;
	IE_UART1 = 1;
}


void SetDTR_RTS(UINT8 temp){
#if USE_UART_UDISK
    if(!UdiskOCCUart){
#endif
        switch(temp){
            case 0x9f:
#if  USE_MOS
								RTS_LOW;
								DTR_LOW;
#else
								P3 |=  0x08; //P3.3 HIGH
								RTS_HIGH;
								DTR_HIGH;
#endif
                break;
            case 0xdf:
#if 	USE_MOS
								RTS_HIGH;
								DTR_LOW;
#else
								P3 &=  ~0x08; //P3.3 LOW
								RTS_LOW;
								DTR_HIGH;
#endif
                break;
            case 0xff:
#if  USE_MOS
								RTS_LOW;
								DTR_LOW;
#else
								P3 |=  0x08; //RTS HIGH
								RTS_HIGH;
								DTR_HIGH;
#endif
                break;
            case 0xbf:
#if  USE_MOS
								RTS_LOW;
								DTR_HIGH;
#else
								P3 |=  0x08; //RTS HIGH
								RTS_HIGH;
								DTR_LOW;
#endif
                break;
            default:
                break;
        }
#if USE_UART_UDISK
    }
#endif
}

void clearUart1(){
    //if(UartByteCount > 0){
        UartByteCount = 0;
        Uart_Output_Point = 0;
        Uart_Input_Point = 0;
				U1RI = 0;
		//}
}

void UsbSetBaud(UINT8 Baud0,UINT8 Baud1){
    switch(Baud0){
        case 0x80:
            switch(Baud1){
                case 0x96:                    //110 = 0x6E
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x00;
                    LineCoding[0] = 0x6E;
                    break;
                case 0xd9:                    //300 = 0x12C
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x01;
                    LineCoding[0] = 0x2C;
                    break;
                default:
                    break;
            }
            break;
        case 0x81:
            switch(Baud1){
                case 0x64:                    //600 = 0x258
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x02;
                    LineCoding[0] = 0x58;
                    break;
                case 0xb2:                    //1200 = 0x4B0
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x04;
                    LineCoding[0] = 0xB0;
                    break;
                case 0xd9:                    //2400 = 0x960
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x09;
                    LineCoding[0] = 0x60;
                    break;
                default:
                    break;
            }
            break;
        case 0x82:
            switch(Baud1){
                case 0x64:                    //4800 = 0x12C0
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x12;
                    LineCoding[0] = 0xC0;
                    break;
                case 0xb2:                    //9600 = 0x2580
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x25;
                    LineCoding[0] = 0x80;
                    break;
                case 0xcc:                    //14400 = 0x3840
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x38;
                    LineCoding[0] = 0x40;
                    break;
                case 0xd9:                    //19200 = 0x4B00
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x4B;
                    LineCoding[0] = 0x00;
                    break;
                default:
                    break;
            }
            break;
        case 0x83:
            switch(Baud1){
                case 0x64:                    //38400 = 0x9600
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0x96;
                    LineCoding[0] = 0x00;
                    break;
                case 0x95:                    //5600 = 0xDAC0
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0xDA;
                    LineCoding[0] = 0xC0;
                    break;
                case 0x98:                    //57600 = 0xE100
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x00;
                    LineCoding[1] = 0xE1;
                    LineCoding[0] = 0x00;
                    break;
                case 0xcc:                    //115200 = 0x1c200
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x01;
                    LineCoding[1] = 0xC2;
                    LineCoding[0] = 0x00;
                    break;
                case 0xd1:                    //128000 = 0x1f400
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x01;
                    LineCoding[1] = 0xF4;
                    LineCoding[0] = 0x00;
                    break;
                case 0xe6:                    //230400 = 0x38400
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x03;
                    LineCoding[1] = 0x84;
                    LineCoding[0] = 0x00;
                    break;
                case 0xe9:                    //256000 = 0x3e800
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x03;
                    LineCoding[1] = 0xE8;
                    LineCoding[0] = 0x00;
                    break;
                case 0xf3:                    //460800 = 0x70800
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x07;
                    LineCoding[1] = 0x08;
                    LineCoding[0] = 0x00;
                    break;
                case 0xf4:                    //512000 = 0x7D000
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x07;
                    LineCoding[1] = 0xD0;
                    LineCoding[0] = 0x00;
                    break;
                case 0xf6:                    //600000 = 0x927C0
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x09;
                    LineCoding[1] = 0x27;
                    LineCoding[0] = 0xC0;
                    break;
                case 0xf8:                    //750000 = 0xB71B0
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x0B;
                    LineCoding[1] = 0x71;
                    LineCoding[0] = 0xB0;
                    break;
                default:
                    break;
            }
            break;
        case 0x87:
            switch(Baud1){
                case 0xf3:                    //921600 = 0xE1000
                    LineCoding[3] = 0x00;
                    LineCoding[2] = 0x0E;
                    LineCoding[1] = 0x10;
                    LineCoding[0] = 0x00;
                    break;
                default:
                    break;
            }
            break;
        default:
            break;
    }
		Config_Uart1(LineCoding);
}


