wxzed/CH552_NOUDISK/S_CDC/CDC.C
}

UINT8 testBuf[4] = {0x00, 0x00, 0xFF, 0xFE};
void InitUSB_Device(){
    USB_CTRL = 0x00;                                                //清空USB控制寄存器
    USB_CTRL &= ~bUC_HOST_MODE;                                     //该位为选择设备模式
    USB_CTRL |=  bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN;         //USB设备和内部上拉使能,在中断期间中断标志未清除前自动返回NAK
    USB_DEV_AD = 0x00;                                              //设备地址初始化
    USB_CTRL &= ~bUC_LOW_SPEED;
    UDEV_CTRL &= ~bUD_LOW_SPEED; 	                                  //选择全速12M模式，默认方式
    UDEV_CTRL = bUD_PD_DIS;                                         // 禁止DP/DM下拉电阻
    UDEV_CTRL |= bUD_PORT_EN;                                       //使能物理端口

    UEP0_DMA = Ep0Buffer;
    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
    UEP0_T_LEN = 0;

    UEP2_3_MOD = 0xCC;
    UEP4_1_MOD = 0X40;

    UEP1_DMA = Ep1Buffer;
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;
		UEP1_T_LEN = 0;

    UEP2_DMA = Ep2Buffer;
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
    UEP2_T_LEN = 0;

    USB_INT_EN |= bUIE_SUSPEND;                                     //使能设备挂起中断
    USB_INT_EN |= bUIE_TRANSFER;                                    //使能USB传输完成中断
    USB_INT_EN |= bUIE_BUS_RST;                                     //使能设备模式USB总线复位中断
    USB_INT_FG |= 0x1F;                                             //清中断标志
    IE_USB = 1;                                                     //允许单片机中断
    EA = 1;
}

//主函数
main()
{
	UINT8 lenth;
	UINT8 j = 0;
	UINT8 i = 0;
	UINT8 Uart_Timeout = 0;
	UINT8 nowStatus = 0;
    CfgFsys( );                                                           //CH559时钟选择配置
    mDelaymS(100);                                                          //修改主频等待内部晶振稳定,必加	
		P1_MOD_OC &= ~0x40;//rx 推挽输出
		P1_DIR_PU &= ~0x40; //rx 高阻输入模式
	  P1_MOD_OC |= 0x80; //tx 开漏输出
		P1_DIR_PU &= ~0x80; //tx 禁止上拉
#if  USE_MOS
		P1_MOD_OC &= ~0x10; //RTS 推挽输出
		P1_DIR_PU |= 0x10; //RTS 输出
		P1_MOD_OC &= ~0x20; //DTR 推挽输出
		P1_DIR_PU |= 0x20; //DTR 输出
		RTS_LOW;
		DTR_LOW;
#else
		P3_MOD_OC |= 0x08;  //P3.3 开漏输出
		P3_DIR_PU &= ~0x08; //P3.3 禁止上拉
		P3_MOD_OC |= 0x04;  //P3.2 开漏输出 FLAG
		P3_DIR_PU &= ~0x04; //P3.2 禁止上拉 FLAG
		P1_MOD_OC |= 0x10;  //RTS  开漏输出
		P1_DIR_PU &= ~0x10; //RTS  禁止上拉
		P1_MOD_OC |= 0x20;  //DTR  开漏输出
		P1_DIR_PU &= ~0x20; //DTR  禁止上拉
		RTS_HIGH;
		DTR_HIGH;
#endif
		mDelaymS(200);  
    mInitSTDIO( );                                                        //串口0,可以用于调试
    UART1Setup( );                                                        //用于CDC
#ifdef DE_PRINTF
    printf("start ...\n");
#endif	

    /*USBDeviceCfg(); 
    USBDeviceEndPointCfg();                                               //端点配置
    USBDeviceIntCfg();                                                    //中断初始化*/
		InitUSB_Device();
		clearUart1();
		FLAG_HIGH;
	  //UEP0_T_LEN = 0;
    //UEP1_T_LEN = 0;                                                       //预使用发送长度一定要清空
    //UEP2_T_LEN = 0;                                                       //预使用发送长度一定要清空
    while(1)
    {
		if(UsbConfig)
		{
			if(USBByteCount)   //USB接收端点有数据
			{
				CH554UART1SendByte(Ep2Buffer[USBBufOutPoint++]);
				USBByteCount--;
				if(USBByteCount==0) 
					UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
			}
			if(UartByteCount){
				Uart_Timeout++;
			}
				
			if(!UpPoint2_Busy)   //端点不繁忙（空闲后的第一包数据，只用作触发上传）
			{
				lenth = UartByteCount;
				if(lenth>0)
				{
					if(lenth>31 || Uart_Timeout>100)
					{		
						//printf("send ok\r\n");
						Uart_Timeout = 0;
						if(Uart_Output_Point+lenth>UART_REV_LEN)
							lenth = UART_REV_LEN-Uart_Output_Point;
						UartByteCount -= lenth;			
						//写上传端点
						memcpy(Ep2Buffer+MAX_PACKET_SIZE,&Receive_Uart_Buf[Uart_Output_Point],lenth);
						Uart_Output_Point += lenth;
						if(Uart_Output_Point >= UART_REV_LEN)
							Uart_Output_Point = 0;						
						UEP2_T_LEN = lenth;                                                    //预使用发送长度一定要清空
						UpPoint2_Busy = 1;
						UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //应答ACK
						//UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //应答ACK
					}
				}
			}else{
				//printf("else\r\n");
				lenth = UartByteCount;
				if(lenth>0){
					if(lenth>31 || Uart_Timeout>100){
						Uart_Timeout = 0;
							//printf("MAC MAC\r\n");
							UartByteCount-=lenth;
							//memcpy(Ep1Buffer+MAX_PACKET_SIZE,testBuf,4);
							//UEP1_T_LEN = 4; 
							//UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; 
					}
				}
				
			}
		}		
    }
}
